cis240dl_samba.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Samba on Fedora</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Samba on Fedora"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-09-15 Thu"/>
<meta name="author" content="Dennis Kibbe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://www.w3.org/StyleSheets/Core/Oldstyle.css" /> 


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Samba on Fedora</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Assignment Objectives</a></li>
<li><a href="#sec-3">3 Terms You Should Know</a></li>
<li><a href="#sec-4">4 Preparation</a></li>
<li><a href="#sec-5">5 Create Samba User</a></li>
<li><a href="#sec-6">6 Create a Samba Share</a>
<ul>
<li><a href="#sec-6-1">6.1 Add Content</a></li>
<li><a href="#sec-6-2">6.2 Add Samba Group</a></li>
<li><a href="#sec-6-3">6.3 Add jstudent to the Samba Group</a></li>
<li><a href="#sec-6-4">6.4 Set Permissions and Ownership</a></li>
</ul>
</li>
<li><a href="#sec-7">7 SELinux</a></li>
<li><a href="#sec-8">8 Install Configuration Tools</a></li>
<li><a href="#sec-9">9 Configuration</a>
<ul>
<li><a href="#sec-9-1">9.1 Samba</a></li>
<li><a href="#sec-9-2">9.2 Firewall</a></li>
<li><a href="#sec-9-3">9.3 Test the Configuration</a></li>
</ul>
</li>
<li><a href="#sec-10">10 Connect from Windows</a></li>
<li><a href="#sec-11">11 What to Submit</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
  Samba provides secure, stable and fast file and print services for Linux and Windows clients using the SMB/CIFS protocol.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Assignment Objectives</h2>
<div class="outline-text-2" id="text-2">


<p>
  When you have successfully completed this assignment you will be able to:
</p>
<ul>
<li>Configure a Samba server on Fedora.
</li>
<li>Create a Samba user.
</li>
<li>Configure SELinux to work with Samba.
</li>
<li>Connect to the Samba server from a Windows workstation.
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Terms You Should Know</h2>
<div class="outline-text-2" id="text-3">


<dl>
<dt>/etc/samba/smb.conf</dt><dd>The Samba configuration file.
</dd>
<dt>smb</dt><dd>Server Message Block daemon
</dd>
<dt>nmb</dt><dd>NetBIOS Message Block daemon
</dd>
<dt>smbclient</dt><dd>CLI tool to show Samba configuration.
</dd>
<dt>testparm</dt><dd>CLI tool to check /etc/samba/smb.conf syntax.
</dd>
<dt>system-config-samba</dt><dd>GUI configuration tool for Samba
</dd>
<dt>firewall-config</dt><dd>GUI firewall configuration tool
</dd>
</dl>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Preparation</h2>
<div class="outline-text-2" id="text-4">


<ul>
<li>Use a Fedora virtual Machine on the 192.168.201.0/24 network.
</li>
<li>Set networking to <i>Bridged adapter</i>, connect the cable and refresh the MAC address.
</li>
<li>Boot the VM and take a <a href="https://www.virtualbox.org/manual/ch01.html#snapshots">snapshot</a> in VirtualBox so you can roll back if you have problems.
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Create Samba User</h2>
<div class="outline-text-2" id="text-5">


<p>   
   Create a new user that you will add as a Samba user.
</p>



<pre class="example"># useradd jstudent
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Create a Samba Share</h2>
<div class="outline-text-2" id="text-6">


<ol>
<li>Add a directory to share.
</li>
</ol>


<pre class="example">
# mkdir -p /srv/data
</pre>



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Add Content</h3>
<div class="outline-text-3" id="text-6-1">


<p>
   Create a text file in the shared directory.  Change <i>jstudent</i> to your name and the IP address to that of your Samba server.
</p>
<pre class="example">
# echo "This is Jstudent on 192.168.201.123" &gt; /srv/data/Success!
</pre>


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Add Samba Group</h3>
<div class="outline-text-3" id="text-6-2">


<pre class="example">
# groupadd staff
</pre>


</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Add jstudent to the Samba Group</h3>
<div class="outline-text-3" id="text-6-3">


<pre class="example">
# usermod -aG staff jstudent
# smbpasswd -a tux
</pre>


</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Set Permissions and Ownership</h3>
<div class="outline-text-3" id="text-6-4">


<pre class="example">
# chgrp -R staff /srv/smb/data
# chmod 0755 /srv/smb/data
</pre>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> SELinux</h2>
<div class="outline-text-2" id="text-7">


<p>
  The directory you created needs the correct SELinux security context.  The last command will allow Samba users to access their home directories as well.
</p>



<pre class="example"># chcon -R -t samba_share_t /srv/smb/data
# semanage fcontext -a -t samba_share_t /srv/smb/data
# setsebool -P samba_enable_home_dirs on
</pre>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Install Configuration Tools</h2>
<div class="outline-text-2" id="text-8">





<pre class="example"># dnf install system-config-samba firewall-config
</pre>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Configuration</h2>
<div class="outline-text-2" id="text-9">



</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Samba</h3>
<div class="outline-text-3" id="text-9-1">


<p>
   Open the Samba configuration tool.
</p>
<ol>
<li>Add <i>jstudent</i> as a Samba user.
</li>
<li>Add <code>/srv/data</code> as a Samba share.
</li>
</ol>


</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Firewall</h3>
<div class="outline-text-3" id="text-9-2">


<p>
   Open the firewall configuration tool.
</p>
<ol>
<li><i>Sambaclient</i> should already be checked as a service.
</li>
<li>Make the change permanent.
</li>
</ol>


</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Test the Configuration</h3>
<div class="outline-text-3" id="text-9-3">


<p>
   You can test the configuration from another Linux VM using <code>smbclient</code>.
</p>
<pre class="example">
$ smbclient -L \\192.168.201.123 -U jstudent
</pre>


</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Connect from Windows</h2>
<div class="outline-text-2" id="text-10">


<p>
  From the Windows Run dialog box using the IP address of your Samba server.
</p>
<pre class="example">
\\192.168.201.123
</pre>


<p>
  You will be asked for the user name and password for <i>jstudent</i>.  The network password will be the same.
</p>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> What to Submit</h2>
<div class="outline-text-2" id="text-11">


<p>
  Submit a screenshot of the output of the <code>smbclient</code> command showing the Samba share or from Windows showing the connection.
</p>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-09-15 Thu</p>
<p class="author">Author: Dennis Kibbe</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
